; Вычисляем (x + 2*x^2) / (x - 1)
; cdecl, возвращает double в st(0)

.386
.model flat, C

.code

compute_func PROC
    push    ebp

    ; Получаем указатель на аргумент через ebx
    mov     ebp, esp
; ====================================
; 		         Стек
;	[esp]       -> сохранённый ebp
;	[esp+4]     -> возвратный адрес
;	[esp+8]     -> аргумент x
; ====================================
    fld     qword ptr [ebp + 8]     ; st(0) = x

    ; Числитель: x + 2*x^2
    fld     st(0)                   ; st(0) = x, st(1) = x
    fmul    st(0), st(0)            ; st(0) = x^2, st(1) = x
    fadd    st(0), st(0)            ; st(0) = 2*x^2, st(1) = x
    fadd    st(0), st(1)            ; st(0) = 2*x^2 + x

    ; --- Знаменатель: x - 1 ---
    fld     qword ptr [ebp + 8]     ; st(0) = x, st(1) = числитель
    fld1                            ; st(0) = 1.0, st(1) = x, st(2) = числитель
    fsub    st(1), st(0)            ; st(1) = x - 1, st(0) = 1.0, st(2) = числитель
    ; fxch    st(1)                   ; st(0) = x - 1, st(1) = 1.0, st(2) = числитель
    ; fstp    st(1)                   ; удаляем 1.0 → st(0) = x-1, st(1) = числитель
    fstp st
    ; --- Деление: числитель / знаменатель ---
    ; Числитель в st(1), знаменатель в st(0)
    fdivr   st(0), st(1)            ; st(0) = st(1) / st(0) = числитель / знаменатель

    ; Очищаем стек (остался только результат в st(0))

    pop     ebp
    ret
compute_func ENDP

END